{
    "podcast_details": {
        "podcast_title": "The Carly P Reilly Show",
        "episode_title": "Elon's War on \"Activist Judge\" Backfired",
        "episode_image": "https://static.libsyn.com/p/assets/b/6/a/9/b6a93ec6541e1263e5bbc093207a2619/carly_reilly_1-20231121-gt51wco66p.png",
        "episode_transcript": " Elon Musk has been angrily tweeting a lot about activist judges lately. But one of those activist judges, one that he had called out by name, just bested him at the Supreme Court. So that is what we are talking about today. We are talking about what has happened, what will happen from here, and most importantly, why was I right? Why was I correct? Welcome to the Carly P. Riley Show. I'm Carly P. Riley. Let's take a look, first and foremost, what happened. The US Supreme Court upholding a judge's order that could force the Trump administration to resume foreign aid payments. Yes, so the US Supreme Court, in their first ruling on any of the lawsuits related to Trump's executive orders, essentially stood by There's some caveats here, but stood by a district judge, a district judge in DC, Judge Amir Ali, and have granted Amir Ali's right to force the Trump administration to pay out $2 billion in payments by USAID that they had previously frozen. And this flies in the face of Elon Musk, who has been very active lately in tweeting about all the problems that these activist judges are posing. So for example, Elon had tweeted, We do not have democracy. We have tyranny of the judiciary.\" And he had attacked this one judge in particular, Judge Amir Ali. He had tweeted, when judges egregiously undermine the democratic will of the people, they must be fired or democracy dies. And this was Elon Musk retweeting and responding to a Tennessee congressperson who had said, I'm drafting articles of impeachment for U.S. District Judge Amir H. Ali, yet another partisan activist attempting to weaponize his position to block President Trump from cutting wasteful foreign funding. Now, what is so interesting about this is what does Elon mean by activist judge? Well, presumably he means a judge that is partisan, a judge who is not acting based on what is best for the public or in accordance with the Constitution or rule of law, He is simply a judge who wants to further some sort of political, ideological, partisan narrative. Now, ironically, Elon tends to ascribe the label of activist judge to any judge who does not agree with him and Trump. And of course, if judges have to agree with him and Trump in order to be in Elon's good graces, I mean, that is the definition of partisanship. But you know what? It's possible. Maybe it's just a coincidence that all of the judges that Elon says are activists are judges that do what he doesn't want. Maybe they really are activist judges. Or at least that theory would have held more weight until the Supreme Court essentially sided with Judge Amir Ali, one of these judges that Elon Musk and this Tennessee congressman claim is just a partisan activist. But now you have this conservative Supreme Court. The Supreme Court in which 33% of the justices on the court were nominated by current President Donald Trump, they have sided effectively with Judge Amir Ali. Now, I hate to say I told you so, but I did tweet a few days ago, I think even before we maybe realized the Supreme Court was looking at this specific case, but I can't remember. I tweeted, my take is that even this Supreme Court will find the actions regarding USAID illegal, but you never know. I had also said this on a recent episode of the podcast. I believe strongly having looked into this with no preconceived notions that courts will find this to be illegal. But I do want to talk about some of the caveats. Let's talk about these caveats because the truth is the Supreme Court in this 5-4 decision, they basically just passed the power back down to the district court. They didn't really take a strong stance on anything except saying, hey, we are not going to, and I'm going to get some of these specific terms wrong, but like we're not going to vacate what the district judge has said to do. This is where you have to remember, I'm not a lawyer. I can, at a layman's level, understand what is going on, but I'm going to get some of the specific semantic terminology wrong. But basically, the Supreme Court was like, we put the power back in Judge Amir Ali's hands to do what he wants, and this is actually very important, and I'll talk about why. At the heart of this case is a question around the separation of powers. How much power does the executive branch have? How much power does the legislative branch have? How much power does the judicial branch have? And this has been something that has come up quite a lot because you've had the situation where the executive branch and the Trump administration via Doge has been freezing funding. So they froze all of the payments out of USAID. for example. Now, as we talked about before, Congress has the power of the purse, Congress has the power to determine what money gets spent, and the executive branch is required to take care, this is language that is in the Constitution, take care to make sure that the laws are faithfully executed as they've been written by Congress. This has been interpreted to mean including making sure that funds that have been appropriated by Congress actually get spent. And there's been additional laws that have been passed in the 1970s saying that the president cannot impound funds, he cannot stop funding from going out, funding that Congress has said that needs to go out. Okay. So that is fundamentally the case being made by the plaintiffs, the NGOs who in this case sued the Trump administration over the fact that they froze $2 billion and more in payments out of USAID. But what's interesting is the Trump administration did not argue against any of those pieces directly. They did not claim that the president can, in fact, impound funds. They did not claim that the president doesn't have to spend money appropriated by Congress. I'm sure in no small part because the Trump administration and their lawyers, who are very smart, realize they're not going to get anywhere on those arguments. This is pretty settled law. So what they were trying to do was trying to circumvent the Impoundment Control Act, some of the laws that I just described, by taking a slightly different tact. So what the Trump administration was arguing was, A, that this foreign aid spending falls under foreign policy and that the executive branch has a lot of power, which is true, around foreign policy. But more importantly, they were arguing that a district court judge, Judge Amir Ali in this case, does not have the power to force the government to pay out $2 billion. Now, part of this argument was you have a couple of nonprofits who have brought this lawsuit against us. Judge Amir Ali may be able to force us to pay out funds to those specific nonprofits who are bringing this lawsuit, for example, but he does not have the power to, on the basis of these couple of lawsuits brought by these couple of people, tell us we need to pay out all of the money to all of the NGOs, to all of the groups who say we owe them money up to this point, or who we do owe money to up to this point. all of this, this is not about money, it's not about freezing future funding. This is all a fight over does the Trump administration need to pay out money that has already been contractually obligated and the work has already been done. The Trump administration is saying, as part of their argument, you know, he cannot, Judge Amir Ali, this district court judge, cannot force us to pay out All $2 billion that it is claimed we are owed to all of these NGOs that is overreach of his power. And so that fundamentally is what the Supreme Court was looking at most recently. There are still a lot of components of this case that need to be worked out. They need to be worked out on their merits. the limits of the president's control or not or whatever, that all hasn't been worked out. This is just a decision about whether this district judge has the right to force the Trump administration to pay out this $2 billion. So the fact that the Supreme Court has basically said yes, the district judge does have this right is a pretty big deal because this is an even narrower, smaller issue than some of the bigger issues that are gonna be faced in this whole case. And I personally think this therefore bodes pretty well for the bigger questions that will be faced in this case. around the separation of powers. Now, the conservatives are displeased with this. And of course, none of them are saying that this is fundamentally about a separation of powers. They are not saying that this is fundamentally about the Impoundment Control Act. Again, that is settled law. No honest, even conservative is going to pretend that the president has the power to impound funds. But here's Ben Shapiro, for example, talking about why he is so displeased with this. As Justice Alito says, if the effect of the order is to force the federal government to disperse funds it can't get back before the adjudication at the Supreme Court level, then that is a massive problem. Ben is obviously a Republican. He is somebody who believes in smaller, more limited government. And so for him, there is a massive problem in the idea that this district judge can force the government to pay out $2 billion in funding to these NGOs and to everything else before the case itself, this fundamental case about what is going on with USAID, has even been heard by the Supreme Court. But here's the thing, if the reverse had been true, if the Supreme Court had decided district judges don't have the power to do this, to force the Trump administration, for example, to pay out $2 billion, here's what this would mean functionally. It would mean that the Impoundment Control Act, while still in effect, would be significantly gutted or significantly reduced in the impact it can have. And here's why. If the Trump administration could force every individual NGO that they owe money to, or across the government, everybody who the government owes money to, if they were all forced to individually bring their case to the government to beg for funding, and the government could then delay giving that funding through all sorts of different court tactics and legal tactics and this and that, it would create a dynamic in which the executive branch would have a tremendous amount of power to effectively stop paying anyone they want to stop paying. Because they could delay it, these court orders, they would create and they would put an onerous burden on the groups to try and get their money. And all of that again creates a dynamic in which effectively the executive branch can control what groups do and do not get money versus that power remaining with Congress. And for me, as somebody who really likes the separation of power, does not want to see too much power consolidated within the executive branch, is more than happy to have Congress hold the purse strings, this is a win for me. If you are a super small government conservative, as Ben Shapiro is, I understand. That's your prerogative. That is why for somebody like him, this is a loss. But what is frustrating to me is the semantic thing that the conservatives are doing saying this is really just about the power of a district judge, when fundamentally no, what we are talking about is we're talking about gutting the impoundment control act. If you let this something like this, if you don't give district judges this kind of power, you are effectively de-fanging this law, and frankly you're de-fanging, in my opinion, what exists in the Constitution, this take care clause of the Constitution, which gives Congress this power and forces the executive to faithfully enact the laws out there passed by Congress. So personally, I am pleased with this decision. You had two conservative justices, Justice Roberts and Justice Amy Coney Barrett, siding with the liberals in order for this ruling to have existed the way it did. To summarize here, I mean, this, first and foremost, it curbs executive power, which to me is a good sign. that this Supreme Court will uphold various separation of powers that I believe in. It shows that the Supreme Court, even this conservative 6-3 Trump-appointed Supreme Court, is not going to just rubber-stamp anything the President wants to do and to achieve, which I think is an excellent thing. You want an independent judiciary, that is fantastic. And finally, it flies in the face of this narrative that Elon Musk has been sowing on Twitter, which is to undermine faith in our judiciary, claiming that all of these judges are simply activist judges, when in fact, clearly, you have the Supreme Court, loosely speaking, siding with Amir Ali. I keep giving that caveat because it's not like they've said they think what Amir Ali decided was correct, but they have said that Amir Ali has the right to decide that way. So that's a little bit of a semantic difference. But this is a repudiation of Elon's frequent efforts to suggest that anyone who won't just go along with the Trump administration is inherently an activist judge. In any case, that is our show for today. I hope you did enjoy. If you did, please leave a comment below. If you're listening to this on the podcast, tweet at me, comment on YouTube, leave a comment. We'd love to hear what you're thinking. And with that, see you next time."
    },
    "podcast_summary": "In this podcast episode, the host discusses the recent Supreme Court ruling that upheld a judge's order requiring the Trump administration to resume foreign aid payments. The ruling essentially sided with a district judge, Judge Amir Ali, against whom Elon Musk had expressed criticism on Twitter. The host delves into the concept of an \"activist judge,\" arguing that Musk tends to label any judge who disagrees with him and Trump as partisan activists. The Supreme Court's decision, with the conservative majority also supporting Judge Ali, challenges Musk's narrative. The episode further explores the separation of powers and the Trump administration's argument that the district judge does not have the authority to force payment of the disputed funds. The host contends that the ruling curbs executive power and upholds the impoundment control act, favoring a separation of powers. The episode concludes by highlighting the significance of the Supreme Court's decision and its disagreement with Musk's portrayal of activist judges.",
    "podcast_guest": {
        "name": "Elon Musk",
        "job": "CEO of SpaceX and Tesla",
        "wiki_title": "Wealth of Elon Musk",
        "wiki_summary": "Elon Musk is the  wealthiest person in the world, with an estimated net worth of US$305 billion as of March 16, 2025, according to the Bloomberg Billionaires Index, and $320 billion according to Forbes, primarily from his ownership stakes in Tesla and SpaceX. \nHaving been first listed on the Forbes Billionaires List in 2012, around 75% of Musk's wealth was derived from Tesla stock in November 2020. Describing himself as \"cash poor\", a year later, he became the first person in the world to have a net worth above $300 billion. By December 2024, he became the first person to reach a net worth of $400 billion.\n\n",
        "wiki_url": "https://en.wikipedia.org/wiki/Wealth_of_Elon_Musk",
        "wiki_img": "",
        "google_URL": "https://en.wikipedia.org/wiki/Elon_Musk"
    },
    "podcast_highlights": "Highlight 1 of the podcast:\n\"The US Supreme Court upholding a judge's order that could force the Trump administration to resume foreign aid payments.\"\n\nHighlight 2 of the podcast:\n\"Now, what is so interesting about this is what does Elon mean by activist judge? Well, presumably he means a judge that is partisan, a judge who is not acting based on what is best for the public or in accordance with the Constitution or rule of law.\"\n\nHighlight 3 of the podcast:\n\"Now, the conservatives are displeased with this. And of course, none of them are saying that this is fundamentally about a separation of powers. They are not saying that this is fundamentally about the Impoundment Control Act. Again, that is settled law.\"\n\nHighlight 4 of the podcast:\n\"If the reverse had been true, if the Supreme Court had decided district judges don't have the power to do this, to force the Trump administration, for example, to pay out $2 billion, here's what this would mean functionally. It would mean that the Impoundment Control Act, while still in effect, would be significantly gutted or significantly reduced in the impact it can have.\"\n\nHighlight 5 of the podcast:\n\"To summarize here, I mean, this, first and foremost, it",
    "podcast_sentiment": {
        "overall": {
            "neg": 0.063,
            "neu": 0.803,
            "pos": 0.134,
            "compound": 1.0
        },
        "speakers": {},
        "interpretation": "The podcast expresses a highly positive and enthusiastic tone.",
        "metrics_explanation": {
            "compound": "Overall sentiment score from -1 (extremely negative) to +1 (extremely positive).",
            "pos": "Proportion of text considered positive.",
            "neu": "Proportion of text considered neutral.",
            "neg": "Proportion of text considered negative."
        }
    }
}