{
    "podcast_details": {
        "podcast_title": "The Hollow",
        "episode_title": "Introducing: Unspookable \"The Legend of Sleepy Hollow\"",
        "episode_image": "https://megaphone.imgix.net/podcasts/fbc7e21c-309f-11ee-bb8d-8b3564dfd4cd/image/cc61755cd889f9c7bb0965ac8f6c3ef5.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress",
        "episode_transcript": " Hello? Who's there? Oh, it's you. Listen, it's almost All Hallows' Eve, and GZM wants to give you another treat for your ears. Up next is an episode of the podcast, Unspookable, from our friends at Soundington Media, where they chat with one of GZM's co-founders, David Kreisman, about the legend of Sleepy Hollow. Listen in as they talk about the history of the legend and why the story of the headless horseman has endured for centuries. And if you like this episode, be sure to follow the podcast Unspookable for more episodes where they take a family-friendly look at the histories and mysteries behind your favorite scary stories. And without further ado, on with the show. Enjoy! The tractor's engine rumbles to life, and the flat-bedded wagon jolts forward, creaking along the dirt path. Halloween is a special time for your family, and every year you find something fun to do together. Your sister might act like she's too old for trick-or-treating or costume parades, but she reluctantly decided to join you on this haunted hayride for the sake of tradition. You, your sister, mom and dad sit on the wagon covered in bales of hay. Or is it straw? You can never tell the difference. The sky is pitch black and the only light comes from the full moon casting eerie shadows on the trees around you. The woods are dense on either side. They're twisted branches reaching out like skeletal hands. The sound of crunching leaves under the wagon, mixed with the cheesy effects of what sound like howling wolves, keep you on your guard. You laugh it all off, but you're nervous as you approach your first spooky display. You round a bend of trees and see the path open up to a small, fog-covered graveyard. Foam tombstones extend out from the ground at odd angles, and the mist swirls around the wagon's wheels. You hear a loud snort, and a giant dark figure slowly emerges from the mist. Wait, he's atop a horse, but something… something's not right. To your right, you hear a gasp. You turn to see your sister raise her finger to point at the stranger and with a shaky voice she screams, he has no head. Everyone sits frozen, gripping the bales of straw hay beneath them as the rider's silhouette looms large against the moonlight. Is this a part of the ride or are you actually seeing the headless horseman? Washington Irving's 1820 tale of a headless horseman who terrorizes the village of Sleepy Hollow is widely considered to be one of the first American ghost stories, and we'd argue, still one of the scariest. Why has this tale and this figure endured for over 200 years, inspiring films, cartoons, games, and even entire podcasts? We talk this week with David Kreisman, the CCO of Gen Z Media and co-creator and writer of their hit show, The Hollow, to find out. That and more on this episode of Unspookable. The Headless Horseman is a German soldier who wears a very old-timey outfit. His head got blown off by a cannon in the American Revolution. He is the ghost of the German soldier. He roams the streets on his horse of sleepy hollow looking for his head. I know the headless horseman from the Disney cartoon and he rides around on a black horse dressed in all black and scares people in the forest while carrying a jack-o-lantern for a head because he doesn't have one. He had a jack-o-lantern in his hand and he threw it at Ichabod and he fell. He covered his face and whenever he looked up, the headless horseman was alive. I'm here this week with Unspookable producer Nate Dufort. Hey, everybody. And we're excited this week to welcome David Kreisman, the CCO of Gen Z Media and co-creator and writer of their hit show, The Hollow. David, welcome to the show. Thanks. Thanks for having me. I'm excited to be here. We receive a lot of listener suggestions for topics to cover on Unspookable. And one that comes up time and time again is the headless horseman made famous from Washington Irving's story, The Legend of Sleepy Hollow. Why do you feel this story has endured? And why are we still talking about it nearly 200 years after its release? I think it really is that image of the horseman with no head and he's holding that pumpkin or he has a pumpkin as his own head. I think everybody knows what that is and somehow that's kind of gotten into our visual lexicon, you know, in the same way that Frankenstein's monster and Dracula, all of the monsters that we love through the years, he's part of that now. Whether people know the full story, whether they've seen the animated movie from the 60s, I think everybody knows that guy. We still see it as Halloween costumes. There's just something very striking and scary about it. For sure. Yeah. And for those who may not be familiar, could you give us an overview of Irving's original short story? Yeah, so the story is about this schoolteacher, Ichabod Crane, who moves to the town of Sleepy Hollow in New York. And there's this legend in the town of a headless horseman who was the ghost of a Hessian soldier that was killed during the Revolutionary War. And Ichabod kind of falls for this woman named Katrina von Tassel, and he's competing for her affections with a guy named Brom Bones, who's this big blowhard. And they have this party and as Ichabod is going home that night, he has to cross this bridge, this scary bridge where they say the headless horseman looms. And he's riding his horse and suddenly he seems to be chased by the headless horseman. And we don't know exactly what happened. Did the headless horseman actually appear? Because the next morning all they find is the shattered pumpkin and Ichabod Crane was never seen again. So Irving leaves it with us not knowing whether the headless horseman was real or not. And I think that's another reason why the story has endured so much because we get to project our own fears and our own beliefs in what happened onto that. Dave, you know, I'm such a huge fan of the shows you make at GZM and your work on The Hollow is absolutely no exception. Why did you decide to take on and modernize the story? Well, it was the 200th year anniversary of the story, and we were looking to do a Halloween show. And a friend of mine named Lucky Gold, who's a writer that works with us sometimes, he actually had the idea. He said, could we do something for the 200th anniversary? And a lot of times when we modernize something, we have this conversation. Do we just make an adaptation, another adaptation? Do we fully modernize it? And then the question was, does the legend of Sleepy Hollow exist in this world? Do the characters in the story know the legend or does the legend happen in our time? So we had that discussion. But it just seemed like a really fun story to say, what does the headless horseman mean in 2020 when we made this? Great. So tell me a little about like your actual story. How and why did you come up with these characters, particularly to kind of perpetuate the story? Well, our shows generally kids are the leads. So they're following the story. So that was something new that we have these three 12 year old kids who attend Sleepy Hollow Middle School. So we put them in the middle of the story. And then we added Ichabod Crane and the idea that is he really the Ichabod Crane from the story? Is he not Ichabod? Was he named after him as a joke? And it seemed like a fun way to investigate whether the original story, whether it was real or not. Are there any fun details on your research or audience reactions to the story that you could share with us? Yeah. So what was really fun was we heard from kids who attend Sleepy Hollow Middle School, the real Sleepy Hollow Middle School in New York. We actually did some classroom visits, some virtual classroom visits. Nice. And they loved it. They also, that town really embraces it. They have big celebrations over Halloween. Their high school mascot is the horseman, which is a headless horse, the football team. wears it on their sleeve. So they were really into it. So that was fun. Because you always worry if you're taking somebody's story in somebody's town that maybe they aren't going to be happy with it. But the kids really loved it. And teachers, too. We heard from some of the teachers at those schools. More when we return. Do you have a favorite topic, monster, or cryptid from an episode of Unspookable? Do you like to draw, paint, or sculpt? Maybe even write poems or songs? Well, we want to share your work while offering you a chance to win an Unspookable t-shirt and other surprises in the first Unspookable Halloween giveaway. Here's all you need to do. Pick your favorite unspookable topic between now and October 31st. Create a piece of art in any medium based on that topic. Maybe it's something you've already made. Have a grownup share your work by either tagging unspookable podcast on Instagram or by emailing the show. Then, Unspookable will post the art on our socials, and five lucky listeners will be chosen at random to receive the prize packages. There's no purchase necessary, and we can't wait to see what you come up with. Full rules and alternative forms of entry available on Instagram. Something that you do better than most is these cliffhangers in your storytelling. I have been talking about the cliffhangers, the resolution at the start of an episode of Six Minutes, for example, that your B or C storyline will hit us in the middle and then an enormous cliffhanger for the end. I just feel like what GZM shows do, you've really mastered all that. But I want to hear like, what do you feel is unique about yours and greater GZM's approach to audio storytelling? Yeah, I think we try to make shows that are, you know, our version of prestige TV. They just don't have visuals. So we want the music to be as big and grand as possible. We want big performances to be, and for the show to be immersive and exciting, a little bit scary, intense for kids. You know, we want kids to listen up a little bit. We also make shows that we want the parents to love as much as the kids do. We know that co-listening is a big part of what we do. So yeah, I just think we never think in our heads, oh, we're making this for kids, so we have to soften it or dumb it down in that way. So I think that's what makes our shows really fun and that you can go back to them a lot of times and maybe listen to it at a different age and get something different from them. I love it. Yeah. Yeah. So hearing all of the wonderful things that go into your shows and to the work that you do, are there any plans for shows this Halloween or spooky season that folks should keep an eye out for? Yeah. So The Hollow, I think is great to listen to every year. We also have a show called Mina and Lucy's Guide to Slaying Dracula, which came out Halloween last year, two years ago. And this year we also are releasing a show called Nightingale Halloween, which is a sequel to our show Nightingale, which came out last year. And it's a Halloween special. It's five episodes and it comes out in the beginning of October. Our characters head back to the magical land of Nightingale, where robots rule, and there's kind of a werewolf story in Nightingale this time. Nice. Awesome. Well, we've got a couple questions for you about the Halloween season. The first one, what are some of your favorite Halloween stories? Well, besides The Legend of Sleepy Hollow, which is actually one of my favorites, I really love all the Frankenstein stories. I think there's something about Frankenstein's monster that has always appealed to me, the idea of being able to create this thing and what makes someone human. I love Halloween stories that are more than just about being scary, that tell us something about ourselves and why we are afraid of these things, and very often learn maybe why we shouldn't be afraid of these things. So those are the kind of stories that I love. That's perfect. What is something that you are scared of? Well, I've been afraid of clowns my whole life. My parents have told me lots of stories of having to pick me up on their shoulder and carry me away, screaming from parades and circuses and things like that. I can't say I'm as afraid now as I was when I was three, but I really still don't like them. Um, one of the stories my parents always told me was that I was thinking I was about four or five years old and, uh, and I came running in and, uh, well, first I'll tell you that. So, so the most famous clown of the day when I was a kid was named Emmett Kelly. He was this famous kind of hobo clown. Um, so I was four years old and I came running in and I said, good news, good news. Emmett Kelly died. Well, kind of dark, but you know, that's amazing. Well, David, we cannot thank you enough for spending some time with us and talking about Spooky Season and the legend of Sleepy Hollow. That's great. This was really fun. The Hollow is available now wherever you get your podcasts. And you may want to catch up on the GZM series Nightingale, as this month the show returns with the all-new Nightingale Halloween, a five-episode series where we head back to the mysterious land of Nightingale. You can find out more about The Hollow, Nightingale, Mina, and Lucy's Guide to Slaying Dracula and all of the great GZM shows at www.gzmshows.com. We're going to leave you now with a taste of this week's topic of conversation. Here is a trailer for GZM Shows, The Hollow. Every town has its ghosts. But in Sleepy Hollow, as Halloween draws near, the wall between the land of the living and the dead comes down. That's when he rides again, the ghost of the headless horseman. Hear that? Sounds like a horse. Where there's a horse. There's a, you know, horseman. It's getting closer! What do we do? Run for the bridge! Two hundred years ago, the legend of Sleepy Hollow introduced readers to the world of Ichabod Crane and the Headless Horseman. Now, two centuries later, the classic tale of Halloween horror has been reimagined for a new generation of families. Is it possible he doesn't mean to harm us? My phone! I highly doubt a ghost from the 18th century has a cell phone. No, I mean, I've got that text-to-speech app. Hello, I am the Horseman. From Gen Z Media, the producers of Six Minutes and the unexplainable disappearance of Mars Battelle, comes The Hollow. A Halloween audio adventure based on the timeless story by Washington Irving. For hundreds of years, the legend has portrayed me as a ghoul and a monster. But you're not, are you? I'm a man who wants to prove I died, for my country. Can Jill, Jack and Adam solve the mystery of the horsemen and maybe even save the town of Sleepy Hollow in the process? Turn down the lights, lock the doors and listen with your whole family. But whatever you do, don't lose your head."
    },
    "podcast_summary": "In this episode of the podcast Unspookable, David Kreisman, the CCO of Gen Z Media and co-creator of the show The Hollow, discusses the enduring legacy of the headless horseman and the legend of Sleepy Hollow. He explains that the headless horseman is a German soldier whose head was blown off by a cannon during the American Revolution. He roams Sleepy Hollow in search of his missing head. Kreisman believes that the image of the headless horseman with a pumpkin for a head has become iconic and ingrained in popular culture. He also discusses the modernization of the Sleepy Hollow story in The Hollow and the positive reception from listeners, particularly from kids at Sleepy Hollow Middle School. Kreisman explains that Gen Z Media aims to create immersive and exciting audio shows that appeal to both kids and adults. He mentions other Halloween-themed shows, such as Mina and Lucy's Guide to Slaying Dracula and Nightingale Halloween, which listeners can look forward to. The episode concludes with a trailer for The Hollow.",
    "podcast_guest": {
        "name": "David Kreisman",
        "job": "CCO of Gen Z Media and co-creator and writer of The Hollow",
        "wiki_title": "",
        "wiki_summary": "",
        "wiki_url": "",
        "wiki_img": "",
        "google_URL": "https://gzmshows.com/shows/listing/the-hollow/team/"
    },
    "podcast_highlights": "Highlight 1 of the podcast:\n\"...the headless horseman who terrorizes the village of Sleepy Hollow is widely considered to be one of the first American ghost stories, and we'd argue, still one of the scariest.\"\n\nHighlight 2 of the podcast:\n\"...everybody knows what that is and somehow that's kind of gotten into our visual lexicon, you know, in the same way that Frankenstein's monster and Dracula...\"\n\nHighlight 3 of the podcast:\n\"...there's just something very striking and scary about it. For sure. Yeah.\"\n\nHighlight 4 of the podcast:\n\"I think everybody knows that guy. We still see it as Halloween costumes.\"\n\nHighlight 5 of the podcast:\n\"I think it really is that image of the horseman with no head and he's holding that pumpkin or he has a pumpkin as his own head.\"",
    "podcast_sentiment": {
        "overall": {
            "neg": 0.051,
            "neu": 0.811,
            "pos": 0.138,
            "compound": 1.0
        },
        "speakers": {}
    }
}