{
    "podcast_details": {
        "podcast_title": "Daily Tech Headlines",
        "episode_title": "New Tariff Policies Caused A Market Selloff Led By Tech Stocks - DTH",
        "episode_image": "https://assets.pippa.io/shows/619570402eacc3a36070252c/1e111bad-e968-444a-b26b-9a07855179c5.png",
        "episode_transcript": " Wanna get this show ad free? Head to DailyTechNewsShow.com slash subscribe to find out how. These are the Daily Tech headlines for Thursday, April 3rd, 2025. I'm Rob Dunwood. Tech stocks fell sharply on Thursday due to President Trump's new tariff policies causing market panic. Apple led the decline among the Magnificent 7 Group, dropping almost 9% as the iPhone maker's overseas production makes it vulnerable to tariffs. Other tech giants like Meta Platforms and Amazon fell over 7%, while Nvidia and Tesla dropped over 5%. Nvidia's reliance on Taiwan and Mexico for chip production and AI assembly added to the losses. Microsoft and Alphabet experienced smaller declines of around 2%. Microsoft has reevaluated its data center development plans indicating a shift in its strategy for building its infrastructure supporting AI and cloud computing. This has resulted in the company pausing negotiations or postponing development for sites in multiple locations globally, including Indonesia, the UK, Australia, Illinois, North Dakota, and Wisconsin. Amazon announced the upcoming launch of its Project Kuiper space internet service, with its first 27 satellites set to launch on April 9 aboard a United Launch Alliance Atlas V rocket. The project, aiming to rival SpaceX's Starlink, will eventually include 3,200 satellites launched by partners like ULA, Arianespace, Blue Origin, and SpaceX. Project Kuiper will offer global coverage with speeds up to 100 megabits for a dish as small as 7 inches. and up to one gigabytes per second for larger dishes. The cost of terminals will be under $400 and Amazon hopes to start offering the service later this year. Google's AI note-taking tool Notebook LM has introduced a new feature called Discover that allows users to obtain summaries and narration on the topic simply by describing it. The tool automatically gathers and utilizes web sources around a given subject, eliminating the need for manual uploads of documents or YouTube links. The rollout of Discover began on Wednesday and will be accessible to all users within a week. YouTube has launched a shopping affiliate program in Singapore partnering with Shopee. The collaboration allows creators to tag products in their videos and live streams, enabling viewers to purchase those products directly through Shopee. This initiative offers Singaporean YouTube creators an additional monetization opportunity beyond ads and memberships, while also providing Shopee sellers with expanded reach and access to a larger customer base. At a New York City event on Thursday, Spotify announced GEN.AI ads and other advertising business changes, including the Spotify Ad Exchange, a new programmatic offering enabling advertisers to reach logged-in Spotify users through real-time auctions. Spotify also announced new partnerships with Google's Demandside platform display in Video 360 and Magnite, with Yahoo! DSP, AdForm, and others coming soon. The trade desk is also supported. Spotify stated that SAX will offer full addressability and measurement capabilities. Automattic, the company behind WordPress.com, Tumblr, and other online services, is laying off 16% of its staff, which amounts to over 270 employees. The company explained that the restructuring was due to competitive market and rapid technological advancements. However, the layoffs also follow a tumultuous year for Automattic, including a legal battle with a WP Engine, over contributions to the WordPress.org project and brand usage. Automatic CEO Matt Mullenwood stated that the layoffs would enable the company to become more agile, efficient, and focused on product quality and long-term financial success. Papa John's International announced on Thursday that it's expanding its partnership with Google Cloud to incorporate artificial intelligence technology into its customer pizza ordering experience. The company plans to leverage AI to personalize phone push notifications, marketing emails, and lowly program offerings based on past customer behavior and other contextual data. Additionally, Papa John's will introduce a new online chat bot and enable ordering through virtual assistants. And finally, Microsoft is celebrating its 50th anniversary on Friday and Bill Gates commemorated the occasion by reminiscing about the company's origins. In a blog post, Gates recalled how he and Paul Allen created Microsoft's first software after reading an article about the Altair 8800 minicomputer. Despite not having a prototype, they promised the Altair maker that they had developed software to control the hardware. Gates and Allen spent two months coding with Gates developing the code that became the foundation for the Altair's operating system Gates considers this code to be the coolest he's ever written and ultimately led to the creation of Microsoft and its suite of software that is widely used still today. For more analysis of the tech news of the day, subscribe to DailyTechNewsShow.com. And if you enjoy the show, remember to tell a friend to check us out. Thanks for listening. We'll talk to you next time."
    },
    "podcast_summary": "On April 3, 2025, tech stocks dropped due to President Trump's new tariff policies, with Apple leading the decline. Microsoft has paused negotiations and postponed development for data center sites globally, indicating a shift in strategy. Amazon announced the launch of Project Kuiper, a space internet service to rival SpaceX's Starlink. Google's AI note-taking tool, Notebook LM, introduced a new feature called Discover, allowing users to obtain summaries and narration on a topic by describing it. YouTube launched a shopping affiliate program in Singapore, partnering with Shopee. Spotify announced advertising business changes, including the Spotify Ad Exchange and new partnerships. Automattic, the company behind WordPress.com, is laying off 16% of its staff. Papa John's is incorporating AI technology into its customer pizza ordering experience. Microsoft celebrated its 50th anniversary, with Bill Gates reminiscing about the company's origins.",
    "podcast_guest": {
        "name": "Rob Dunwood",
        "job": "host",
        "wiki_title": "List of The Haunting Hour: The Series episodes",
        "wiki_summary": "R. L. Stine's The Haunting Hour: The Series is an original anthology horror-fantasy series that originally aired on Discovery Family. The first two episodes of the series were broadcast on October 29, 2010, with the rest of the season beginning on December 25, 2010. Some episodes in the series are based on stories from R. L. Stine's anthologies The Haunting Hour and Nightmare Hour, while others come from different sources. On December 6, 2014, it was confirmed by Stine via Twitter that Discovery Family dropped the show after its run of four seasons.\n\n",
        "wiki_url": "https://en.wikipedia.org/wiki/List_of_The_Haunting_Hour:_The_Series_episodes",
        "wiki_img": "",
        "google_URL": "https://www.instagram.com/brothatech/reel/DHq3opBphDr/"
    },
    "podcast_highlights": "Highlight 1 of the podcast:\n\"Apple led the decline among the Magnificent 7 Group, dropping almost 9% as the iPhone maker's overseas production makes it vulnerable to tariffs.\"\n\nHighlight 2 of the podcast:\n\"Microsoft has reevaluated its data center development plans indicating a shift in its strategy for building its infrastructure supporting AI and cloud computing.\"\n\nHighlight 3 of the podcast:\n\"Amazon announced the upcoming launch of its Project Kuiper space internet service, with its first 27 satellites set to launch on April 9.\"\n\nHighlight 4 of the podcast:\n\"Google's AI note-taking tool Notebook LM has introduced a new feature called Discover that allows users to obtain summaries and narration on the topic simply by describing it.\"\n\nHighlight 5 of the podcast:\n\"Spotify announced GEN.AI ads and other advertising business changes, including the Spotify Ad Exchange, a new programmatic offering enabling advertisers to reach logged-in Spotify users through real-time auctions.\"",
    "podcast_sentiment": {
        "overall": {
            "neg": 0.024,
            "neu": 0.883,
            "pos": 0.093,
            "compound": 0.9931
        },
        "speakers": {},
        "interpretation": "The podcast expresses a highly positive and enthusiastic tone.",
        "metrics_explanation": {
            "compound": "Overall sentiment score from -1 (extremely negative) to +1 (extremely positive).",
            "pos": "Proportion of text considered positive.",
            "neu": "Proportion of text considered neutral.",
            "neg": "Proportion of text considered negative."
        }
    }
}