{
    "podcast_details": {
        "podcast_title": "NPR News Now",
        "episode_title": "NPR News: 03-30-2025 1AM EDT",
        "episode_image": "https://media.npr.org/assets/img/2023/03/01/npr-news-now_square.png?s=1400&c=66",
        "episode_transcript": " This message comes from Progressive Insurance and the Name Your Price tool. It helps you find car insurance options in your budget. Try it today at progressive.com. Progressive Casualty Insurance Company and Affiliates. Price and coverage match limited by state law. Not available in all states. Live from NPR News, I'm Dale Willman. Israel and Hamas say they've responded to a ceasefire proposal from international mediators. NPR's Hadil Al-Shalchi reports. In a speech, a Hamas official said the group has agreed to a proposal offer from international mediators, while the Israeli Prime Minister's office says it has countered with its own proposal in coordination with the United States. Neither side confirmed the details publicly, but they have been negotiating on how many hostages Hamas would release for a ceasefire. This is the first sign of progress towards a ceasefire since the war broke out again last week. Israel returned to war to pressure Hamas to release more hostages, killing more than 800 Palestinians, according to Gaza health officials. Hadil Alshalchi, NPR News. The death toll from the powerful earthquake in Myanmar on Friday has climbed to more than 1,600 and officials say they expect that number to go even higher. The search for those still buried under the rubble meanwhile continues and one woman was pulled out of the wreckage of a 12-story apartment building in Mandalay alive. The BBC's Nick Beek has more. Beneath the historic temples of Mandalay, the destructive power of Myanmar's worst earthquake in a century is clear to see. The country's second largest city bore the full force. At the Sky Villa condominium, they were digging through the rubble with their hands. 90 people were feared to be trapped. The building housed apartments and a wedding venue, but its 12 stories now resemble six after it pancaked in seconds. That's the BBC's Nick Beek reporting from Bangkok. Protests continue this weekend outside Tesla dealerships in the U.S. and Europe. Tesla is owned by Elon Musk, who is heading President Trump's Department of Government Efficiency. Nicole Regalado of the gender equality group Ultraviolet attended one protest. She says the administration has its priorities wrong. While the administration is busy protecting Tesla from peaceful protesters, it's refusing to protect doctors and other reproductive health care providers from harassment and violence. While there have been acts of violence against some Tesla dealerships over the past few weeks, Saturday's protests were loud but peaceful. The Associated Press is reporting that an American woman who has been detained in Afghanistan for weeks has been now released. Faye Dale Hall was detained in February on charges of using a drone without authorization. She was released on Thursday. It was part of a deal that was brokered by negotiators in Qatar. The Danish foreign minister is scolding the Trump administration for the way in which it's criticizing Denmark and Greenland. Greenland is a part of the Kingdom of Denmark. Vice President JD Vance visited Greenland on Friday and said Denmark is not paying enough attention to Greenland's security, and President Trump continues to say he wants the U.S. to take control of Greenland. You're listening to NPR News. A British museum has agreed to return a 17th century painting to its Jewish owner's descendants. The decision comes more than 80 years after the painting was stolen by the Nazis. Vicki Barker has more from London. The 1654 oil painting Aeneas and His Family Fleeing Burning Troy by Henry Gibbs was part of an extensive collection amassed by art dealer Samuel Hartfeldt in pre-war Belgium. It fell into the hands of the Nazis after Hartfeld and his wife fled Antwerp in 1940. London's Tate Museum bought it from a Belgian gallery in 1994 after research, which it now says failed to include vital information. And now Tate Britain has agreed to return the painting to Hartfeld's descendants. They've said they are deeply grateful. Tate's director says it's been, quote, a profound privilege to help reunite this work with its rightful heirs. For NPR News, I'm Vicki Barker in London. A Vatican doctor says Pope Francis has shown surprising improvement in his health since he returned to the Vatican a week ago. Francis had spent more than four weeks in a Rome hospital where he was treated for a life-threatening bout of double pneumonia. Madison Chalk and Evan Bates have become the first ice dancers to win three consecutive world championships in almost three decades. The American skaters took first place with the jazzy free skate, holding off Canadian rivals Piper Gillis and Paul Poirier, who claimed the silver. Lila Feer and Lewis Gibson, meanwhile, claimed the bronze. That was Britain's first medal in the event since 1984. I'm Dale Willman, NPR News. This message comes from Mint Mobile. Mint Mobile took what's wrong with wireless and made it right. They offer premium wireless plans for less, and all plans include high-speed data, unlimited talk and text, and nationwide coverage. See for yourself at mintmobile.com slash switch."
    },
    "podcast_summary": "- Israeli and Hamas have responded to a ceasefire proposal from international mediators, with both sides presenting their own counterproposals.\n- The death toll from the earthquake in Myanmar has risen to over 1,600, with officials expecting the number to increase.\n- Protests have continued outside Tesla dealerships, with demonstrators criticizing the Trump administration for prioritizing the protection of Tesla over healthcare providers.\n- An American woman detained in Afghanistan has been released as part of a deal brokered by negotiators in Qatar.\n- The Danish foreign minister has criticized the Trump administration for its comments about Denmark and Greenland.\n- A British museum has agreed to return a painting stolen by the Nazis to its Jewish owner's descendants.\n- Pope Francis has shown improvement in his health since returning to the Vatican.\n- American ice dancers Madison Chalk and Evan Bates have won three consecutive world championships.",
    "podcast_guest": {
        "name": "Dale Willman",
        "job": "NPR News Reporter",
        "wiki_title": "List of NPR personnel",
        "wiki_summary": "The following is a list of National Public Radio personnel:",
        "wiki_url": "https://en.wikipedia.org/wiki/List_of_NPR_personnel",
        "wiki_img": "",
        "google_URL": "https://www.npr.org/people/g-s1-5634/dale-willman"
    },
    "podcast_highlights": "Highlight 1 of the podcast: \"This is the first sign of progress towards a ceasefire since the war broke out again last week.\"\nHighlight 2 of the podcast: \"The death toll from the powerful earthquake in Myanmar on Friday has climbed to more than 1,600 and officials say they expect that number to go even higher.\"\nHighlight 3 of the podcast: \"Protests continue this weekend outside Tesla dealerships in the U.S. and Europe.\"\nHighlight 4 of the podcast: \"The Associated Press is reporting that an American woman who has been detained in Afghanistan for weeks has been now released.\"\nHighlight 5 of the podcast: \"A British museum has agreed to return a 17th century painting to its Jewish owner's descendants.\""
}